Repository: RayanceKing/CCZUHelper
Catalog: CCZUHelperWidget/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

# widget.class_count
source: 节
en: classes
ja: 節
ko: 교시

# widget.courses_count
source: 共 %d 门课
en: %d courses
ja: コース
ko: 과목
zh_hant: 共 %d 門課

# widget.current_course
source: 当前
en: Current
ja: 現在
ko: 현재
zh_hant: 當前

# widget.current_time
source: 当前时间
en: Current Time
ja: 時間
ko: 시간
zh_hant: 當前時間

# widget.date_format
source: M月d日 EEEE
en: MMM d, EEEE

# widget.date_format_full
source: yyyy年M月d日 EEEE
en: MMMM d, yyyy EEEE

# widget.description
source: 查看今日课程安排
en: View today's courses
ja: 今日
ko: 오늘
zh_hant: 查看今日課程安排

# widget.duration
source: %d节
en: %d classes
ja: %d節
ko: %d교시

# widget.intent.configuration.auto_refresh
source: 自动刷新
en: Auto Refresh
ja: 自動更新
ko: 자동 새로고침
zh_hant: 自動刷新

# widget.intent.configuration.description
source: 配置小组件刷新行为。
en: Configure refresh behavior for the widget.
ja: ウィジェットの更新動作を設定します。
ko: 위젯의 새로고침 동작을 설정합니다.
zh_hant: 配置小組件刷新行為。

# widget.intent.configuration.title
source: 小组件设置
en: Widget Settings
ja: ウィジェット設定
ko: 위젯 설정
zh_hant: 小組件設定

# widget.intent.manual_refresh.description
source: 手动刷新小组件时间线。
en: Manually refresh the widget timeline.
ja: ウィジェットのタイムラインを手動で更新します。
ko: 위젯 타임라인을 수동으로 새로고칩니다.
zh_hant: 手動刷新小組件時間線。

# widget.intent.manual_refresh.title
source: 刷新小组件
en: Refresh Widget
ja: ウィジェットを更新
ko: 위젯 새로고침
zh_hant: 刷新小組件

# widget.intent.refresh_interval.15m
source: 15 分钟
en: 15 min
ja: 15分
ko: 15분
zh_hant: 15 分鐘

# widget.intent.refresh_interval.30m
source: 30 分钟
en: 30 min
ja: 30分
ko: 30분
zh_hant: 30 分鐘

# widget.intent.refresh_interval.60m
source: 60 分钟
en: 60 min
ja: 60分
ko: 60분
zh_hant: 60 分鐘

# widget.intent.refresh_interval.120m
source: 120 分钟
en: 120 min
ja: 120分
ko: 120분
zh_hant: 120 分鐘

# widget.intent.refresh_interval.smart
source: 智能
en: Smart
ja: スマート
ko: 스마트
zh_hant: 智慧

# widget.intent.refresh_interval.type
source: 自动刷新间隔
en: Auto Refresh Interval
ja: 自動更新間隔
ko: 자동 새로고침 간격
zh_hant: 自動刷新間隔

# widget.location
source: 地点
en: Location
ja: 場所
ko: 장소
zh_hant: 地點

# widget.lockscreen.no_course
source: 无课程
en: No Class
ja: クラスなし
ko: 수업 없음
zh_hant: 无課程

# widget.lockscreen.rest
source: 休息时间
en: Rest Time
ja: 時間
ko: 시간
zh_hant: 休息時間

# widget.no_courses
source: 今天没有课程
en: No courses today
ja: 今日
ko: 오늘
zh_hant: 今天没有課程

# widget.no_courses_enjoy
source: 享受美好的一天！
en: Enjoy your day!
ja: 素晴らしい一日をお過ごしください！
ko: 좋은 하루 되세요!

# widget.no_courses_rest
source: 好好休息吧！
en: Have a good rest!
ja: ゆっくり休んでください！
ko: 잘 쉬세요!

# widget.status.current
source: 当前
en: Current
ja: 現在
ko: 현재
zh_hant: 當前

# widget.status.done
source: 完成
en: Done
ja: 完了
ko: 완료

# widget.status.next
source: 下一节
en: Next
ja: 下一節
ko: 下一교시

# widget.status.upcoming
source: 临近
en: Upcoming
ja: 近づいている
ko: 곧 시작

# widget.teacher
source: 教师
en: Teacher
ja: 教師
ko: 교사
zh_hant: 教師

# widget.title
source: 课程表
en: Schedule
ja: 時間割
ko: 시간표
zh_hant: 課程表

# widget.today_courses
source: 今日课程
en: Today's Courses
ja: 今日
ko: 오늘
zh_hant: 今日課程

# widget.today_schedule
source: 今日课程表
en: Today's Schedule
ja: 今日
ko: 오늘
zh_hant: 今日課程表

# widget.total_courses
source: 总课程
en: Total
ja: 総コース数
ko: 총 과목 수
zh_hant: 總課程

# widget.total_duration
source: 总课时
en: Hours
ja: 総授業時間
ko: 총 수업 시간
zh_hant: 總課時
